package L1;

/*
Вывести в консоль от 1000 до 100 в обратном порядке
Вывести в консоль от 10 до 100 через каждые 5 цифр
Вывести в консоль от 99 до 11, что бы было 99.88.77 и т.д
Вывести в консоль все четные числа от 2 до 52
Вывести в консоль все нечетные числа чередуя 3, из цифры 66 тесть 3,6,9 и т.д
 */
public class L2 {
    public static void main(String[] args) {
//        for (int i = 1000; i >= 100 ; i = i-100) {
//            System.out.println("Hello "+ i);
//        }
//        for (int j = 10; j <=100 ; j= j+5) {
//            System.out.println("Value"+ j);
//        }
//        for (int k = 11; k <= 99; k= k + 11) { // нужно в обратном порядке
//            System.out.println("Hi"+k);
//        }
//        for (int l = 99; l >=11 ; l= l - 11) {
//        System.out.println("Hi"+ l);
//        }
//        for (int m = 2; m <=52 ; m= m+2) {
//            System.out.println("Nihao"+ m);
//        }
        for (int n = 3; n <= 66; n = n + 3) {
            System.out.println(n);
        }
    }
}
